
[MZBitterFrostProtocolTech X2TechTemplate]
DisplayName="Bitterfrost Protocol"
Summary="While we can't produce the components of Frost Bombs fast enough for mass deployment in the field, there are several methods that may enable us to deliver a similar, although likely weaker, effect."

[MZBuildCryolator X2TechTemplate]
DisplayName="Build Cryolator"
Summary="We can build aditional Cryolators given the time and materials. The large amounts of bitterfrost involved means it can only be safely done in the proving grounds."

[MZBuildCryolatorMG X2TechTemplate]
DisplayName="Build Advanced Cryolator"
Summary="We can build aditional Advanced Cryolators given the time and materials. The large amounts of bitterfrost involved means it can only be safely done in the proving grounds."

[MZBuildCryolatorBM X2TechTemplate]
DisplayName="Build Superior Cryolator"
Summary="We can build aditional Superior Cryolators given the time and materials. The large amounts of bitterfrost involved means it can only be safely done in the proving grounds."

[MZBuildCryolauncher X2TechTemplate]
DisplayName="Build Cryolaucher"
Summary="By using bitterfrost instead of the typical rocket payload, we can create a heavy weapon that can deliver the chilling effects at extreme range."

[MZUpgradeCryolauncher X2TechTemplate]
DisplayName="Upgrade Cryolauncher"
Summary="Advancements in our technology makes it possible to enhance our cryolaunchers with higher damage and area of effect. It will take some time to upgrade each launcher."

[MZWinterKingFangsTech X2TechTemplate]
DisplayName="The Winter King's Fangs"
Summary="The Viper King's fangs remain exceedingly cold even long after it's death. Considering how durable they appear to be, we could likely use them to create an exceptionaly dangerous weapon for our skirmisher allies." 

[MZFrostRounds X2AmmoTemplate]
FriendlyName="Bitterfrost Rounds"
FriendlyNamePlural="Bitterfrost Rounds"
BriefSummary="These rounds deliver a cryogenic vapour on impact that impairs mobility, and with sufficent application freezes enemies solid."
TacticalText="<Bullet/> The first and second hits apply increasing strong mobility and dodge debuffs.<br> <Bullet/> A third hit will freeze the target.<br><Bullet/> Frozen enemies have reduced defense.<br>"

[MZBitterFrostGrenade X2GrenadeTemplate]
FriendlyName="Bitterfrost Grenade"
FriendlyNamePlural="Bitterfrost Grenades"
BriefSummary="A concussive grenade that blasts enemies with cryogenic vapour in a small area of effect. Effective at reducing enemy mobility."
TacticalText="<Bullet/> The first and second hits apply increasing strong mobility and dodge debuffs.<br> <Bullet/> A third hit will freeze the target.<br><Bullet/> Frozen enemies have reduced defense.<br><Bullet/> Grenades can destroy targets' equipment, so relying on grenades too much will reduce our salvage opportunities."
ThrownAbilityName="Throw Bitterfrost Grenade"
ThrownAbilityHelpText="Throw a Bitterfrost Grenade at target area. Chills and shreds armour."
LaunchedAbilityname="Launch Bitterfrost Grenade"
LaunchedAbilityHelpText="Launch a Bitterfrost Grenade at target area. Chills and shreds armour."

[MZBitterFrostBomb X2GrenadeTemplate]
FriendlyName="Bitterfrost Bomb"
FriendlyNamePlural="Bitterfrost Bomb"
BriefSummary="A concussive grenade that blasts enemies with cryogenic vapour in a small area of effect. Effective at reducing enemy mobility."
TacticalText="<Bullet/> The first and second hits apply increasing strong mobility and dodge debuffs.<br> <Bullet/> A third hit will freeze the target.<br><Bullet/> Frozen enemies have reduced defense.<br><Bullet/> Grenades can destroy targets' equipment, so relying on grenades too much will reduce our salvage opportunities."
ThrownAbilityName="Throw Bitterfrost Bomb"
ThrownAbilityHelpText="Throw a Bitterfrost Bomb at target area. Chills and shreds armour."
LaunchedAbilityname="Launch Bitterfrost Bomb"
LaunchedAbilityHelpText="Launch a Bitterfrost Bomb at target area. Chills and shreds armour."

[MZBitterFrostWarhead X2GrenadeTemplate]
FriendlyName="Bitterfrost Warhead"
FriendlyNamePlural="Bitterfrost Warhead"
BriefSummary="A concussive grenade that blasts enemies with cryogenic vapour in a small area of effect. Effective at reducing enemy mobility."
TacticalText="<Bullet/> The first and second hits apply increasing strong mobility and dodge debuffs.<br> <Bullet/> A third hit will freeze the target.<br><Bullet/> Frozen enemies have reduced defense.<br><Bullet/> Grenades can destroy targets' equipment, so relying on grenades too much will reduce our salvage opportunities."
ThrownAbilityName="Throw Bitterfrost Warhead"
ThrownAbilityHelpText="Throw a Bitterfrost Warhead at target area. Chills and shreds armour."
LaunchedAbilityname="Launch Bitterfrost Warhead"
LaunchedAbilityHelpText="Launch a Bitterfrost Warhead at target area. Chills and shreds armour." 

[MZIceWristBlade_CV X2PairedWeaponTemplate]
FriendlyName="The Winter King's Fangs"
FriendlyNamePlural="The Winter King's Fangs"
BriefSummary="Ripped from the jaws of the Viper King, these Fangs are cold as death itself, chilling foes with every strike and can even instantly freeze foes with a special grapple attack."
TacticalText="<Bullet/>The first and second hits apply increasing strong mobility and dodge debuffs.\n<Bullet/> A third hit will freeze the target.\n<Bullet/>Skirmishers can utilize their ripjacks in conjunction with their grapple to become a terror all over the battlefield.\n<Bullet/> The decision to engage the enemy in melee combat can be a decisive one; exercise caution.\n<Bullet/> Keep an eye out for opportunities to improve our edged weapon effectiveness - the enemy may have access to much better technology."
AbilityDescName="ripjack"

[MZIceWristBlade_MG X2PairedWeaponTemplate]
FriendlyName="The Winter King's Fangs"
FriendlyNamePlural="The Winter King's Fangs"
BriefSummary="Ripped from the jaws of the Viper King, these Fangs are cold as death itself, chilling foes with every strike and can even instantly freeze foes with a special grapple attack."
TacticalText="<Bullet/>The first and second hits apply increasing strong mobility and dodge debuffs.\n<Bullet/> A third hit will freeze the target.\n<Bullet/> Skirmishers can utilize their ripjacks in conjunction with their grapple to become a terror all over the battlefield.\n<Bullet/> The decision to engage the enemy in melee combat can be a decisive one; exercise caution.\n<Bullet/> Keep an eye out for opportunities to improve our edged weapon effectiveness - the enemy may have access to much better technology."
AbilityDescName="ripjack"

[MZIceWristBlade_BM X2PairedWeaponTemplate]
FriendlyName="The Winter King's Fangs"
FriendlyNamePlural="The Winter King's Fangs"
BriefSummary="Ripped from the jaws of the Viper King, these Fangs are cold as death itself, chilling foes with every strike and can even instantly freeze foes with a special grapple attack."
TacticalText="<Bullet/>The first and second hits apply increasing strong mobility and dodge debuffs.\n<Bullet/> A third hit will freeze the target.\n<Bullet/> Skirmishers can utilize their ripjacks in conjunction with their grapple to become a terror all over the battlefield.\n<Bullet/> The decision to engage the enemy in melee combat can be a decisive one; exercise caution.\n"
AbilityDescName="ripjack"

[XComCryolator_CV X2WeaponTemplate]
FriendlyName="Cryolator"
FriendlyNamePlural="Cryolators"
BriefSummary="This experimental chemical thrower fires a stream of freezing mist, chilling and damaging multiple targets."
TacticalText="<Bullet/> The first and second hits apply increasing strong mobility and dodge debuffs.<br> <Bullet/> A third hit will freeze the target.<br><Bullet/> Frozen enemies have reduced defense.<br><Bullet/>Overwatch splash damage is only able to apply the first degree of chill.<br>"
AbilityDescName="cryolator"

[XComCryolator_MG X2WeaponTemplate]
FriendlyName="Advanced Cryolator"
FriendlyNamePlural="Advanced Cryolators"
BriefSummary="This experimental chemical thrower fires a stream of freezing mist, chilling and damaging multiple targets."
TacticalText="<Bullet/> The first and second hits apply increasing strong mobility and dodge debuffs.<br> <Bullet/> A third hit will freeze the target.<br><Bullet/> Frozen enemies have reduced defense.<br><Bullet/>Overwatch splash damage is only able to apply the first degree of chill.<br>"
AbilityDescName="cryolator"

[XComCryolator_BM X2WeaponTemplate]
FriendlyName="Superior Cryolator"
FriendlyNamePlural="Superior Cryolators"
BriefSummary="This experimental chemical thrower fires a stream of freezing mist, chilling and damaging multiple targets."
TacticalText="<Bullet/> The first and second hits apply increasing strong mobility and dodge debuffs.<br> <Bullet/> A third hit will freeze the target.<br><Bullet/> Frozen enemies have reduced defense.<br><Bullet/>Overwatch splash damage is only able to apply the first degree of chill.<br>"
AbilityDescName="cryolator"

[MZIceThrower X2AbilityTemplate]
LocFriendlyName="Fire Cryolator"
LocLongDescription="Expel a stream of freezing mist, chilling and damaging multiple targets in a cone."
LocHelpText="Expel a stream of freezing mist, chilling and damaging multiple targets in a cone."
LocFlyOverText="Fire Cryolator"

[MZChemstormIce X2AbilityTemplate]
LocFriendlyName="Ice Storm"
LocLongDescription="Use the Cryolator to attack all units in a complete circle around the soldier's position."
LocHelpText="Use the Cryolator to attack all units in a complete circle around the soldier's position."
LocFlyOverText="Ice Storm"

[MZFreeBitterfrostGrenade X2AbilityTemplate]
LocFriendlyName="Bitterfrost Bomber"
LocLongDescription="Grants a free Bitterfrost Grenade item to the <Ability:CLASSNAME/>'s inventory."
LocHelpText="Grants a free Bitterfrost Grenade item to the <Ability:CLASSNAME/>'s inventory."
LocFlyOverText="Bitterfrost Bomber"
LocPromotionPopupText="<Bullet/> The free grenade is not affected by Packmaster.<br/>"

[MZIceVest X2EquipmentTemplate]
FriendlyName="Frostweave"
FriendlyNamePlural="Frostweave"
BriefSummary="Frostweave not only grants a bonus to soldier health, but will instantly freeze any enemy melee attackers."
TacticalText="<Bullet/> Frostweave will freeze any enemy that strikes the soldier in melee.\n<Bullet/> The enemy will also be chilled, reducing mobility even after they recover from freezing.\n<Bullet/>The insulation in this vest provides immunity to fire and ice damage. \n<Bullet/>Frostweave also grants a small health bonus." 

[MZIceVestStats X2AbilityTemplate]
LocFriendlyName="Frostweave"
LocLongDescription="Grants immunity to fire and cold, and will instantly freeze any enemy melee attackers."
LocHelpText="Grants immunity to fire and cold, and will instantly freeze any enemy melee attackers."
LocFlyOverText="Frostweave"

[MZCryoLauncher X2WeaponTemplate]
FriendlyName="Cryolauncher"
FriendlyNamePlural="Cryolaunchers"
BriefSummary="Micro-missile technology has allowed us to miniaturize a rocket launcher and mount it on our heavy armor systems. This variant delivers a payload of freezing mist, inhibiting mobility and potential freezing multiple targets."
TacticalText="<Bullet/>Unlike normal rockets, cryolaunchers do not damage cover or armour.\n<Bullet/> The first and second hits apply increasing strong mobility and dodge debuffs.\n<Bullet/> A third hit will freeze the target.\n<Bullet/> Frozen enemies have reduced defense."

[MZCryoLauncherMk2 X2WeaponTemplate]
FriendlyName="Superior Cryolauncher"
FriendlyNamePlural="Superior Cryolaunchers"
BriefSummary="Micro-missile technology has allowed us to miniaturize a rocket launcher and mount it on our heavy armor systems. This variant delivers a payload of freezing mist, inhibiting mobility and potential freezing multiple targets."
TacticalText="<Bullet/>Unlike normal rockets, cryorockets do not damage cover or armour.\n<Bullet/> The first and second hits apply increasing strong mobility and dodge debuffs.\n<Bullet/> A third hit will freeze the target.\n<Bullet/> Frozen enemies have reduced defense."

[MZCryoLauncher X2AbilityTemplate]
LocFriendlyName="Cryolauncher"
LocHelpText="Fire a cryorocket at target area."

[SparkMZCryoLauncher X2AbilityTemplate]
LocFriendlyName="Cryolauncher"
LocHelpText="Fire a cryorocket at target area."

[MZBitterfrostBlood X2AbilityTemplate]
LocFriendlyName="Bitterfrost Blood"
LocLongDescription="Bestows immunity to cold. Cleanse disabling effects and freezes adjacent foes when damaged."
LocHelpText="Bestows immunity to cold. Cleanse disabling effects and freezes adjacent foes when damaged."
LocFlyOverText="Bitterfrost Blood"

[MZBitterfrostBloodTrigger X2AbilityTemplate]
LocFriendlyName="Bitterfrost Blood"
LocLongDescription="Bestows immunity to cold. Cleanse disabling effects and freezes adjacent foes when damaged."
LocHelpText="Bestows immunity to cold. Cleanse disabling effects and freezes adjacent foes when damaged."
LocFlyOverText="Bitterfrost Blood"

[MZIceCanister X2WeaponTemplate]
FriendlyName="Bitterfrost Canister"
FriendlyNamePlural="Bitterfrost Canisters"
BriefSummary="This Canister enables the soldier to use an alternative ice attack with thier Chemthrower."
TacticalText="<Bullet/> Canisters can only be used alongside Chemthrowers.<br><Bullet/> Grants <Ability:ICECANISTER_USES> uses of an icy chemthrower attack.<br/><Bullet/> Deals <Ability:MZICECANISTER_SCALAR/> of the Chemthrower's base damage as Ice damage.<br><Bullet/> This attack applies bitterfrost, the first and second hits apply increasing strong mobility and dodge debuffs.<br><Bullet/> A third hit will freeze the target.<br><Bullet/> Frozen enemies have reduced defense.<br><Bullet/> If equipped with a ice chemthrower, the chemthrower will do +<Ability:MATCHINGCANISTER_BONUS> bonus damage on direct attacks."
AbilityDescName="Canister"
[MZIceCanister X2AbilityTemplate]
LocFriendlyName="Activate Bitterfrost Canister"
LocLongDescription="Activate to expel a stream of freezing mist in a cone with your chemthrower. Inflicts bitterfrost and ice damage."
LocHelpText="Activate to expel a stream of freezing mist in a cone with your chemthrower. Inflicts bitterfrost and ice damage."
LocFlyOverText="Activate Bitterfrost Canister"
[MZIceCanisterActivate X2AbilityTemplate]
LocFriendlyName="Activate Bitterfrost Canister"
LocLongDescription="Activate to expel a stream of freezing mist in a cone with your chemthrower. Inflicts bitterfrost and ice damage."
LocHelpText="Activate to expel a stream of freezing mist in a cone with your chemthrower. Inflicts bitterfrost and ice damage."
LocFlyOverText="Activate Bitterfrost Canister"
